{
  "Murder and Being Murdered": "Since returning these days, everything feels surreal. The wound on my face seems to still ache faintly, but when I touch it, everything is as good as new, as if nothing had happened.\n\nI killed someone, yet I bore no responsibility for it. I returned here, squeezing into the crowd at 9 AM, only to be thrown back into a closed world in the evening.\n\nEight months ago, I participated as the second batch of test subjects in Company A's chip implant experiment. After their great success in the previous experiment, they expanded the slots by ten thousand, open to anyone physically and mentally fit.\n\nThis upgraded chip from Company A not only allows you to revisit your memories, but more interestingly, it enables you to swap brains with others, experiencing someone else's life.\n\nI was long tired of being myself, of living a life so rigidly human. Nothing in my past thirty years left a deep impression, nor did I have a past I wanted to return to. But I was willing to swap with others for fun, perhaps then I could stop being a boring person.\n\nThe three-month observation period quickly passed. The chip adapted well to my brain, and I immediately applied for the thought exchange program, eager to escape my body.\n\nMy exchange partner was matched based on age; he was an ordinary man from a southern county, named Li Wei. We had to get to know each other briefly before the exchange, perhaps to adapt quickly after the switch. The meeting ended abruptly. We didn't talk much, and I wasn't interested in his past. Introductions between two adults were filled with unfamiliarity and awkwardness. He seemed eager, though, impatient to experience city life.\n\nWe then signed the exchange agreement for a one-week period, during which either of us could terminate the swap unilaterally. I wasn't used to the stiffness of this body, but being someone else for a short week was indeed liberating.\n\nOn a weekend night, I changed into more comfortable clothes and hit the streets. There were many familiar yet unrecognizable faces, probably remnants of my host's instinctive reactions.\n\nTurning left and right, I found a bar and sat down. The waiter came over with the menu, tossed it on the table, and said with a grin, \"A rare visitor, I've never seen you here before.\"\n\nI felt an instinct to leave but restrained myself.\n\n\"I'm not him. A beer, please.\"\n\nHe left without another word.\n\nEveryone knew about the exchange; there was little else newsworthy. A small TV was on, the noise of the crowd never ceasing. This was supposed to be my last night in this body.\n\nBut the next morning, I woke up still in this body. I received an email from Company A saying there was an emergency with the thought exchange project, and the return of my consciousness might be delayed a few hours.\n\nTwo days passed, and I still hadn't returned to my own body. I sent several emails to the company, only getting dismissive responses about them \"we are handling it with utmost effort.\"\n\nGrowing more anxious, I tried contacting my exchange partner, but my messages went unanswered.\n\nMeanwhile, I noticed my memory fading. What was the name of the person I swapped with? Li Wei? Oh yes, Li Wei. I planned to email my friends, asking them to request leave from the company on my behalf, dealing with the purchase only after I returned.\n\nOn the fourteenth night trapped in this body, I visited the bar again, sitting in a similar spot, watching the TV. It mentioned a company executive's body found in the suburbs, dead no more than fifteen hours.\n\nIt was me!\n\nI stood up suddenly, fear overtaking my mind. On the screen, the dead man's phone cover was a photo I took three months ago on a suburban hilltop, his work ID askew on the left, wearing the sports backpack I rarely used.\n\nThe deceased was me.\n\nMy real body must have come to the suburban woods about fifteen hours ago and committed suicide. It seemed premeditated. In the moonlit woods after midnight, with no one around, a simple gunshot ended his life and mine in the night.",
  
  "Compensation": "This situation is rather absurd. The company should have detected and prevented the suicide of the exchange partner during the swap period. But they might have been too busy dealing with a breach in their mainframe to pay attention.\n\nThe company's proposal seemed reasonable. My original body's heart had stopped, but since the body was found within 12 hours and the brain hadn't completely lost functionality, they planned to use a large-scale unapproved but cutting-edge technology. This involved reading and transferring data through the brain chip, simulating memories in another brain. Essentially, they would copy my memories into this new brain, and I would continue living in his body.\n\nI signed the agreement without much hesitation. I didn't have a strong attachment to that body, and they would update all my biometric information for me. At that time, I didn't realize how this decision would completely change my life.\n\nLi Wei would become me, or rather, I will become him.",
  
  "Transition": "Hello, I am Li Wei, a researcher. I have been studying the mind swap technology developed by Company A for three years. I always wondered if, through this technology, the human brain could transcend its physical limitations. If possible, what differences exist between the world seen through others' eyes and my own world? Is there something beyond consciousness? If I see something as blue, is it also blue for the other person, even though we both call it 'blue'?\n\nThese questions haunted me, keeping me awake at night. When I saw Company A's recruitment list for test subjects, I realized it was a perfect opportunity to become someone else or let someone else become me. I was extremely excited about what might happen.\n\nGetting a seemingly harmless fake identity wasn't difficult. I quickly found an exchange partner and could hardly hide my excitement.\n\nI planned to commit suicide using someone else's body. Where would my consciousness go after death? It should return to my original body, right? But it would be intercepted by the A-chip since it's still trying to receive signals from the now-dead partner. However, the dead partner can only rely on the signals actively sent out by the A-chip for memory reading, meaning its ability to read and control would be greatly limited.\n\nTo me, the partner's brain is just a processor. His vision, smell, touch, are all passive inputs serving my needs, while I actively use memories from my original brain to react. Would I still die? My body is alive, and so is my brain.\n\nWhen people see this dead body, they should first protect the brain, then copy the partner's memories onto my original body through some method, restricting my original memories with the A-chip, allowing the partner to continue living in my body.\n\nBut this technology has a fatal flaw: it can only add memories, not delete them. So, I wouldn't die. Things started getting interesting. He didn't die because his memories still exist in my brain. I didn't die because my heart is still beating. So, whose body is this dead one? Did I force the soul to leave the body through this method?\n\nThere's not much time to think. Midnight is approaching, and I'm thrilled by the thought of this experiment. I need to conduct it before the body is swapped back.",
  
  "Death": "At 11:45 PM, Li Wei, living in someone else's body, pointed the gun at the heart of that person and pulled the trigger. The instant pain exceeded the limits of human endurance, then the brain immediately seemed to block the pain signals and fell into a coma.\n\n...\n\nOnly two hours later, Li Wei felt he woke up again, but everything was strange. He couldn't see or hear, yet he could feel sounds and movements. He couldn't describe what this scene was like. The world seemed chaotic yet accessible everywhere. It was quiet but messy, devoid of any sensation yet there was a sense of temperature and moving space.\n\nTerrifyingly, he still had memories of the past, but now he couldn't describe his situation in any language. The only explanation we could think of was that he was in a superimposed state, where nothing existed but everything acted upon him. He soon realized that the sensation of nothingness came from the dead body of the other person, which no longer provided any input or feedback. However, his brain, his own brain, was being controlled by someone else, but the body's instincts and passive inputs were still instantaneously transmitted into his brain.\n\nHe lost the other person's brain, the core that could process these sensations, yet he could feel the rawest, unprocessed sensations. He had no way to know how he got here or where he was. To this day, we still don't know if he is thinking, as he has lost over 70% of his brain.\n\nA person who can't hear, see, think, only feel, and the feelings do not come from oneself. Is it like being trapped in a cage? Or is it a complete escape from the body?",
  
  "Experiment": "'Hello, Li Wei.'\n\n'... ...'\n\n'Hello, Li Wei.'\n\n'?......?'\n\nIt seems like someone is talking to me!\n\n'Yes, we are talking to you.'\n\nIt's unbelievable, how can I hear your voices?\n\n'We have preserved your brain for experimental purposes, and now we need you to consent to this experiment. Please think 'yes' or 'no' as your answer.'\n\nThis is all so sudden, I think I need some time to think. I feel like I've regained the ability to think, but I'm still trying to get used to it.\n\n'Okay, we used technology to preserve the activity of your exchange partner's brain, originally to extract his memories. But we accidentally found that his cortical activity is still ongoing, so we guess it might be you. The A-chip is still transmitting and storing information, right?'\n\nYes, but how can you directly communicate with my brain?\n\n'It's not difficult. I just need to convert sound into electrical signals that the brain can accept. Theoretically, you can hear my voice, even if you don't have ears or other sensory organs.'\n\nThat makes sense, but why can't I feel my original body anymore? Is he still alive?\n\n'In fact, it has been 208 years since your last swap. Your original body has long been dead, but the brain of your exchange partner was also preserved. This is now a mature technology. We call it an independent brain. Since you are the earliest independent brain, we want to communicate and interview you.'\n\n208 years? I didn't feel the passage of time at all.\n\n'Yes, losing the sense of time is one of the prominent features of an independent brain. We are still unclear about its mechanism. Can you describe your main sensations over this period?'\n\nI feel... calm? Like in a dream, but I feel like I've been in many different places, even seen and heard things.\n\n'Yes, that's also one of the common sensations.'\n\nCan I return to reality?\n\n'In fact, you are in reality right now. In this world, many people choose to exist as independent brains, as part of the world's sub-network. We have an independent brain network. Would you like to join?'\n\nHmm.\n\n'Okay, please wait.'\n\nIn that instant, I felt surrounded by light, returning to the real world. I could feel my hands and even breathe. But the researcher's voice didn't stop: 'All human sensations come from the raw inputs of sensory organs and brain processing. We have recreated the inputs of the real world through signal simulation. You can become anything, a person, an animal, it's just a recreation of Earth.'\n\nSo, I can actually become anything.\n\n'Yes, it depends on what kind of information processing you want. You can even become someone else, theoretically, because you can share an input.'\n\nWon't our thoughts conflict?\n\n'Not necessarily, you can try it out.'\n\nHow?\n\n'Just find someone and stare at them.'\n\n\"I opened the door and walked onto the street. A kid on a bike was coming towards me. In a moment of thought, I unexpectedly found myself becoming him. I put down the bike and returned to my room, facing myself, feeling an indescribable sense of relief.\n\nBut where did he go?\n\n'You are currently sharing this body. You exist in different dimensions. He might continue riding forward, while you returned to your home.'\n\nLike a parallel universe?\n\n'You could say that, but it's more than that. In this world, people can become anyone or anything without distinction. This world itself is a constructed sensory universe. Besides becoming a person, you can also become an object. Imagine becoming a piece of wood, a tree, and feeling the pleasure that the sunshine brings.'\n\n'You must understand that you are no longer in your original brain. We only extracted your memories from your original brain. Whoever the machine reads, it becomes them. We can create new life in this way, endowing it with memories.'\n\n'I am not a real person either, but a composite of many memories. We have extended the lives of many researchers, and now we exist as a whole. If you wish, you can become part of us. This is an invitation to join the independent brain society, published in 2090, 60 years after the production of the A-chip. We invite you to become one of us.'",
  
  "To Leave the Closed-Minded and Essentialist World": "To everyone:\n\nOur Humanity, in the past few thousand years, has had enough of the conflicts brought about by subject and object, resources, environment, and interests. Through systematic brain research, we have reason to believe that all our decisions are constrained by the information processing organization of the cerebral cortex. The world need not be this way.\n\nWe believe the world was originally a whole, and we are all part of this world. The distinction between you and me does not exist; it's the closed human body that caused us to have the illusion of individuality and separation from the outside world.\n\nHumans, a pitiable species, influenced by natural evolution, have to accept the impact of inherent race, ideology, and environment. Now, we have found an exciting new way to leave our innate constraints and join a brand new world.\n\nWe can construct our brains and change our cognition. We can adjust our memories, let go of our past. You can become anyone or even become nothing. The reality we could only escape through death no longer binds us.\n\n\n\nIndependent Thought Alliance\n\n2090/01/01"
}